# DataFrames_Dataset_4thQuestion

# I.	import and read a CSV file

In [172]:
import pandas as pd
import numpy as np

In [162]:
df= pd.read_excel(r'C:\Users\Samsung\Documents\5 th semester subjects\DA\datasets\DataFrames_Dataset_4thQuestion.xlsx')
print (df.head())

   customer_id  year_of_birth  educational_level marital_status  \
0     20201701            1982        Graduation         Single
1     20201702            1950        Graduation        Married
2     20201703            1965        Graduation       Divorced
3     20201704            1984        Graduation   Relationship
4     20201705            1981               PhD        Widowed

   annual_income        purhcase_date  recency  online_purchases  \
0        58138.0  2012-04-09 00:00:00       58                 8
1        46344.0  2014-08-03 00:00:00       38                 1
2        71613.0            8/21/2013       26                 8
3        26646.0  2014-10-02 00:00:00       26                 2
4        58293.0            1/19/2014       94                 5

   store_purchases  complaints  calls  intercoms
0                4           0      3         11
1                2           0      3         11
2               10           0      3         11
3                4           0      3         11
4                6           0      3         11

# II.	To Generate a basic understanding of a given data.

2.aPrint First 5 rows, last 5 rows of data

In [10]:
print("first 5 rows \n",df.head())
print("last 5 rows \n",df.tail())

first 5 rows
    customer_id  year_of_birth  educational_level marital_status  \
0     20201701            1982        Graduation         Single
1     20201702            1950        Graduation        Married
2     20201703            1965        Graduation       Divorced
3     20201704            1984        Graduation   Relationship
4     20201705            1981               PhD        Widowed

   annual_income        purhcase_date  recency  online_purchases  \
0        58138.0  2012-04-09 00:00:00       58                 8
1        46344.0  2014-08-03 00:00:00       38                 1
2        71613.0            8/21/2013       26                 8
3        26646.0  2014-10-02 00:00:00       26                 2
4        58293.0            1/19/2014       94                 5

   store_purchases  complaints  calls  intercoms
0                4           0      3         11
1                2           0      3         11
2               10           0      3         11
3                4           0      3         11
4                6           0      3         11
last 5 rows
      customer_id  year_of_birth  educational_level marital_status  \
494     20202195            1944               PhD       Divorced
495     20202196            1962            Master       Divorced
496     20202197            1978        Graduation       Divorced
497     20202198            1971               PhD   Relationship
498     20202199            1949               PhD   Relationship

     annual_income        purhcase_date  recency  online_purchases  \
494        55614.0           11/27/2013       85                 9
495        59432.0            4/13/2013       88                 5
496        55563.0  2014-05-04 00:00:00       22                 2
497        43624.0            4/21/2013       83                 4
498        41461.0            5/22/2014       63                 6

     store_purchases  complaints  calls  intercoms
494                6           0      3         11
495               11           0      3         11
496                3           0      3         11
497                4           0      6         11
498               11           0      6         11

2.bCheck the basic information of the data

In [11]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 499 entries, 0 to 498
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        499 non-null    int64
 1   year_of_birth      499 non-null    int64
 2   educational_level  499 non-null    object
 3   marital_status     499 non-null    object
 4   annual_income      486 non-null    float64
 5   purhcase_date      499 non-null    object
 6   recency            499 non-null    int64
 7   online_purchases   499 non-null    int64
 8   store_purchases    499 non-null    int64
 9   complaints         499 non-null    int64
 10  calls              499 non-null    int64
 11  intercoms          499 non-null    int64
dtypes: float64(1), int64(8), object(3)
memory usage: 46.9+ KB
None

2.c.Extract the shape of the data

In [18]:
print(df.shape)

(499, 12)

2.d.Print  the unique values of the marital status field based on the  column

In [21]:
print(df.marital_status.unique())

['Single' 'Married' 'Divorced' 'Relationship' 'Widowed' 'Widow']

2.e.To make it consistent data( widow and widowed )are two different naming for the same category on the column values

In [119]:
df['marital_status'] = df['marital_status'].replace('Widow', 'Widowed')
print(df['marital_status'])

0            Single
1           Married
2          Divorced
3      Relationship
4           Widowed
           ...
494        Divorced
495        Divorced
496        Divorced
497    Relationship
498    Relationship
Name: marital_status, Length: 499, dtype: object

2f.Check for duplicates and null values in the whole dataset

In [68]:
print(df.duplicated().any())
print(df.isnull().any())

False
customer_id          False
year_of_birth        False
educational_level    False
marital_status       False
annual_income         True
purhcase_date        False
recency              False
online_purchases     False
store_purchases      False
complaints           False
calls                False
intercoms            False
dtype: bool

# III.	select and filter data based on conditions

3.a.Select a subset of the data points(Birthdate, Education, and Income of every customer) from the data frame.

In [81]:
subset_data = df[['year_of_birth ','educational_level', 'annual_income']]
subset_data

     year_of_birth  educational_level  annual_income
0              1982        Graduation        58138.0
1              1950        Graduation        46344.0
2              1965        Graduation        71613.0
3              1984        Graduation        26646.0
4              1981               PhD        58293.0
..              ...               ...            ...
494            1944               PhD        55614.0
495            1962            Master        59432.0
496            1978        Graduation        55563.0
497            1971               PhD        43624.0
498            1949               PhD        41461.0

[499 rows x 3 columns]

3.b.Using loc() and iloc() methods to retrieve the first seven data points

In [113]:
print("using loc()\n",df.loc[:6,list(df.columns)]) #specify the rows and columns as labels
print("using iloc()\n",df.iloc[:7,[x for x in range(len(df.columns))]])#specify integer locations of columns

using loc()
    customer_id  year_of_birth  educational_level marital_status  \
0     20201701            1982        Graduation         Single
1     20201702            1950        Graduation        Married
2     20201703            1965        Graduation       Divorced
3     20201704            1984        Graduation   Relationship
4     20201705            1981               PhD        Widowed
5     20201706            1967            Master   Relationship
6     20201707            1971        Graduation       Divorced

   annual_income        purhcase_date  recency  online_purchases  \
0        58138.0  2012-04-09 00:00:00       58                 8
1        46344.0  2014-08-03 00:00:00       38                 1
2        71613.0            8/21/2013       26                 8
3        26646.0  2014-10-02 00:00:00       26                 2
4        58293.0            1/19/2014       94                 5
5        62000.0  2013-09-09 00:00:00       16                 6
6        55635.0           11/13/2012       34                 7

   store_purchases  complaints  calls  intercoms
0                4           0      3         11
1                2           0      3         11
2               10           0      3         11
3                4           0      3         11
4                6           0      3         11
5               10           5      3         11
6                7           0      3         11
using iloc()
    customer_id  year_of_birth  educational_level marital_status  \
0     20201701            1982        Graduation         Single
1     20201702            1950        Graduation        Married
2     20201703            1965        Graduation       Divorced
3     20201704            1984        Graduation   Relationship
4     20201705            1981               PhD        Widowed
5     20201706            1967            Master   Relationship
6     20201707            1971        Graduation       Divorced

   annual_income        purhcase_date  recency  online_purchases  \
0        58138.0  2012-04-09 00:00:00       58                 8
1        46344.0  2014-08-03 00:00:00       38                 1
2        71613.0            8/21/2013       26                 8
3        26646.0  2014-10-02 00:00:00       26                 2
4        58293.0            1/19/2014       94                 5
5        62000.0  2013-09-09 00:00:00       16                 6
6        55635.0           11/13/2012       34                 7

   store_purchases  complaints  calls  intercoms
0                4           0      3         11
1                2           0      3         11
2               10           0      3         11
3                4           0      3         11
4                6           0      3         11
5               10           5      3         11
6                7           0      3         11

3.d.In our data, that satisfies two conditions such as choosing the customers with an income higher than 75,000 and with a master’s degree(using python operators) and display the output.

In [116]:
df.iloc[list((df.annual_income > 75000) & (df.educational_level == 'Master')),  :,]

,customer_id,year_of_birth,educational_level,marital_status,annual_income,purhcase_date,recency,online_purchases,store_purchases,complaints,calls,intercoms
18,20201719,1980,Master,Single,76995.0,3/28/2013,91,11,9,4,3,11
51,20201752,1964,Master,Single,79143.0,2012-11-08 00:00:00,2,6,13,0,3,11
55,20201756,1955,Master,Married,82384.0,11/19/2012,55,3,13,0,3,11
60,20201761,1982,Master,Single,75777.0,2013-04-07 00:00:00,12,3,11,0,3,11
76,20201777,1993,Master,Married,75251.0,8/27/2012,34,7,5,0,3,11
109,20201810,1993,Master,Single,89058.0,2012-07-12 00:00:00,18,5,4,0,3,7
120,20201821,1957,Master,Relationship,88193.0,6/20/2013,65,6,10,0,5,11
140,20201841,1987,Master,Single,92859.0,10/19/2012,46,5,12,0,3,2
217,20201918,1985,Master,Widowed,83790.0,11/15/2013,81,8,6,0,3,11
277,20201978,1981,Master,Single,77882.0,4/30/2014,29,3,5,0,3,11
305,20202006,1983,Master,Widowed,80950.0,3/28/2013,44,6,9,0,3,11
423,20202124,1973,Master,Relationship,82584.0,2013-04-06 00:00:00,26,3,8,0,3,11
435,20202136,1983,Master,Relationship,82634.0,6/21/2013,49,1,3,0,0,11

# IV.Apply various data operation tools such as creating new variables or changing data types We can apply different operations on the dataset using Pandas such as

4.a.setting a new index with the variable of our interest using the .set_index() method

In [138]:
df.set_index('customer_id')
print(df)

     customer_id  year_of_birth  educational_level marital_status  \
0       20201701            1982        Graduation         Single
1       20201702            1950        Graduation        Married
2       20201703            1965        Graduation       Divorced
3       20201704            1984        Graduation   Relationship
4       20201705            1981               PhD        Widowed
..           ...             ...               ...            ...
494     20202195            1944               PhD       Divorced
495     20202196            1962            Master       Divorced
496     20202197            1978        Graduation       Divorced
497     20202198            1971               PhD   Relationship
498     20202199            1949               PhD   Relationship

     annual_income        purhcase_date  recency  online_purchases  \
0          58138.0  2012-04-09 00:00:00       58                 8
1          46344.0  2014-08-03 00:00:00       38                 1
2          71613.0            8/21/2013       26                 8
3          26646.0  2014-10-02 00:00:00       26                 2
4          58293.0            1/19/2014       94                 5
..             ...                  ...      ...               ...
494        55614.0           11/27/2013       85                 9
495        59432.0            4/13/2013       88                 5
496        55563.0  2014-05-04 00:00:00       22                 2
497        43624.0            4/21/2013       83                 4
498        41461.0            5/22/2014       63                 6

     store_purchases  complaints  calls  intercoms
0                  4           0      3         11
1                  2           0      3         11
2                 10           0      3         11
3                  4           0      3         11
4                  6           0      3         11
..               ...         ...    ...        ...
494                6           0      3         11
495               11           0      3         11
496                3           0      3         11
497                4           0      6         11
498               11           0      6         11

[499 rows x 12 columns]

4.b.sorting the data frame by one of the variable using .sort_values() with ascending or descending order;

In [140]:
#sort the data by year_of_birth, ascending is default;
df.sort_values(by = ['year_of_birth '], ascending = True) # if we want it in descending we should set ascending = False

,customer_id,year_of_birth,educational_level,marital_status,annual_income,purhcase_date,recency,online_purchases,store_purchases,complaints,calls,intercoms
339,20202040,1899,PhD,Single,83532.0,9/26/2013,36,4,4,0,3,11
32,20201733,1940,Graduation,Married,40548.0,2012-10-10 00:00:00,31,2,4,0,3,11
358,20202059,1943,Master,Married,65073.0,8/20/2013,65,5,5,1,3,11
39,20201740,1943,PhD,Divorced,48948.0,2013-01-02 00:00:00,53,7,5,0,3,11
494,20202195,1944,PhD,Divorced,55614.0,11/27/2013,85,9,6,0,3,11
...,...,...,...,...,...,...,...,...,...,...,...,...
16,20201717,2000,Graduation,Married,41850.0,12/24/2012,51,3,3,7,3,11
418,20202119,2000,Graduation,Single,91065.0,2/22/2013,33,7,9,0,3,11
116,20201817,2000,Graduation,Relationship,90765.0,1/24/2014,25,4,5,0,3,11
185,20201886,2000,Graduation,Single,25271.0,2012-05-12 00:00:00,45,1,2,0,3,11
452,20202153,2000,Master,Single,36230.0,10/17/2013,17,2,4,0,3,11

4.c.creating a new variable which could be the result of a mathematical operation such as sum of other variables

In [141]:
#create a new variable which is the sum of all purchases performed by customers
df['sum_purchases'] = df.online_purchases + df.store_purchases 
df['sum_purchases']

0      12
1       3
2      18
3       6
4      11
       ..
494    15
495    16
496     5
497     8
498    17
Name: sum_purchases, Length: 499, dtype: int64

4.d.changing the datatype of variables into datetime or integer types

In [163]:
#we can change the datatype of purchase_date to datetime and year_birth to integer
print(df['purhcase_date'].dtypes,df['year_of_birth '].dtypes)
df['purhcase_date'] = pd.to_datetime(df['purhcase_date'])
df['year_of_birth '] = df['year_of_birth '].astype(int)
print(df['purhcase_date'].dtypes,df['year_of_birth '].dtypes)

object int64
datetime64[ns] int32

4.e.determining the age based on year of birth

In [164]:
#find out the age of customers based on the current year
from datetime import date
today = date.today()
year = int(today.year)
df['Age'] = year - df['year_of_birth ']
df['Age']

0      41
1      73
2      58
3      39
4      42
       ..
494    79
495    61
496    45
497    52
498    74
Name: Age, Length: 499, dtype: int32

4.f.creating the week date (calendar week and year) from the purchase date

In [169]:
#extract the week_date from the purchase_date which shows the year of purchase and the calendar week
#make sure to change the purhcase_date varibale to datetime as shown above before applying the .isocalendar() method
df['week_date'] = [int(f'{i.isocalendar()[0]}{i.isocalendar()[1]}') for i in df.purhcase_date]
df['week_date']

0      201215
1      201431
2      201334
3      201440
4       20143
        ...
494    201348
495    201315
496    201418
497    201316
498    201421
Name: week_date, Length: 499, dtype: int64

# V.	 perform data aggregation using group by and pivot table methods

5.a.To apply groupby()method to find the mean of income ,recency,number of web and store  purchases by educational group.

In [168]:
#apply groupby to find the mean of income, recency, number of web and store purchases by educational group
aggregate_view = pd.DataFrame(df.groupby(by='educational_level')[['annual_income', 'recency', 'store_purchases',  'online_purchases']].mean()).reset_index()
aggregate_view

,educational_level,annual_income,recency,store_purchases,online_purchases
0,Basic,19514.571429,53.571429,2.857143,1.571429
1,Graduation,51607.827309,47.171206,5.840467,3.887160
2,High School,44154.717949,58.400000,4.600000,3.450000
3,Master,51191.700000,45.000000,5.691358,4.049383
4,PhD,55878.990991,49.008772,6.298246,4.429825

5.b.To apply pivot_table()method to find the aggregated sum of purchases  and mean of recency per education and marital status group.

In [179]:
#apply pivot table to find the aggregated sum of purchases and mean of recency per education and marital status group
pivot_table = pd.DataFrame(pd.pivot_table(df, values=["sum_purchases", "recency"], index=['marital_status'],columns=['educational_level'], aggfunc={'recency': np.mean, 'sum_purchases': np.sum}, fill_value=0)).reset_index()
pivot_table

KeyError: 'sum_purchases'